In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import zscore

In [2]:
bowl = pd.read_csv(r'C:/Users/PYTHON/InternSavy-Projects/Task 3/data/ball.csv')
bat = pd.read_csv(r'C:/Users/PYTHON/InternSavy-Projects/Task 3/data/bat.csv')
match = pd.read_csv(r'C:/Users/PYTHON/InternSavy-Projects/Task 3/data/match.csv')

In [3]:
bowl.head()

,Unnamed: 0,name_x,playing_role,id,order,run_conceded,maidens,wickets,overs,economy,...,matchtype,series_id,match_detail_id,title,runs,over,run_rate,match_id,opp_team_id,team_id
0,8526,Ajit Agarkar,BOWL,8544,2,51,0,2,10.0,5.10,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
1,8518,Tapash Baisya,NaN,8536,0,67,0,2,10.0,6.70,...,odi,182,773,India Innings,245,50.0,4.90,633,7,2
2,8519,Mushfiqur Rahman,NaN,8537,1,29,0,1,6.0,4.83,...,odi,182,773,India Innings,245,50.0,4.90,633,7,2
3,8520,Nazmul Hossain,BOWL,8538,2,39,1,2,9.0,4.33,...,odi,182,773,India Innings,245,50.0,4.90,633,7,2
4,8521,Khaled Mahmud,NaN,8539,3,43,0,1,10.0,4.30,...,odi,182,773,India Innings,245,50.0,4.90,633,7,2

In [4]:
bat.head()

,Unnamed: 0,name_x,playing_role,id,order,runs_x,balls,strike_rate,fours,sixes,...,matchtype,series_id,match_detail_id,title,runs_y,over,run_rate,match_id,opp_team_id,team_id
0,13463,Tapash Baisya,NaN,13464,9,7,5,140.00,1,0,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
1,13462,Khaled Mahmud,NaN,13463,8,21,17,123.52,3,0,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
2,13459,Rajin Saleh,NaN,13460,5,14,28,50.00,1,0,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
3,13461,Mushfiqur Rahman,NaN,13462,7,2,6,33.33,0,0,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
4,13458,Aftab Ahmed,NaN,13459,4,30,49,61.22,2,1,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7

In [5]:
match.head()

,Unnamed: 0,match_number,name,start_date,matchtype,series_id,match_detail_id,scorecard_id,title,runs,over,run_rate,match_id,opp_team_id,team_id
0,1417,1.0,Bangladesh v India,2004-12-22 18:30:00+00:00,odi,182,773,1495,India Innings,245,50.0,4.90,633,7,2
1,1418,1.0,Bangladesh v India,2004-12-22 18:30:00+00:00,odi,182,773,1496,Bangladesh Innings,234,50.0,4.68,633,2,7
2,1419,2.0,Bangladesh v India,2004-12-25 18:30:00+00:00,odi,182,774,1497,Bangladesh Innings,229,50.0,4.58,634,2,7
3,1420,2.0,Bangladesh v India,2004-12-25 18:30:00+00:00,odi,182,774,1498,India Innings,214,47.5,4.47,634,7,2
4,1421,3.0,Bangladesh v India,2004-12-26 18:30:00+00:00,odi,182,775,1499,India Innings,348,50.0,6.96,635,7,2

## Data Wrangling
**Bowling**

In [6]:
bowl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36149 entries, 0 to 36148
Data columns (total 30 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       36149 non-null  int64
 1   name_x           36149 non-null  object
 2   playing_role     34892 non-null  object
 3   id               36149 non-null  int64
 4   order            36149 non-null  int64
 5   run_conceded     36149 non-null  int64
 6   maidens          36149 non-null  int64
 7   wickets          36149 non-null  int64
 8   overs            36149 non-null  float64
 9   economy          36149 non-null  float64
 10  wides            36149 non-null  int64
 11  no_balls         36149 non-null  int64
 12  fours            15 non-null     float64
 13  sixes            15 non-null     float64
 14  zeros            15 non-null     float64
 15  player_id        36149 non-null  int64
 16  scorecard_id     36149 non-null  int64
 17  match_number     35713 non-null  float64
 18  name_y           36137 non-null  object
 19  start_date       36149 non-null  object
 20  matchtype        36133 non-null  object
 21  series_id        36149 non-null  int64
 22  match_detail_id  36149 non-null  int64
 23  title            36149 non-null  object
 24  runs             36149 non-null  int64
 25  over             36149 non-null  float64
 26  run_rate         36149 non-null  float64
 27  match_id         36149 non-null  int64
 28  opp_team_id      36149 non-null  int64
 29  team_id          36149 non-null  int64
dtypes: float64(8), int64(16), object(6)
memory usage: 8.3+ MB

In [10]:
bowl.isnull().sum()

Unnamed: 0             0
name_x                 0
playing_role        1257
id                     0
order                  0
run_conceded           0
maidens                0
wickets                0
overs                  0
economy                0
wides                  0
no_balls               0
fours              36134
sixes              36134
zeros              36134
player_id              0
scorecard_id           0
match_number         436
name_y                12
start_date             0
matchtype             16
series_id              0
match_detail_id        0
title                  0
runs                   0
over                   0
run_rate               0
match_id               0
opp_team_id            0
team_id                0
dtype: int64

In [16]:
columns_to_drop = ['playing_role', 'fours', 'sixes', 'zeros']
bowl.drop(columns_to_drop, axis=1, inplace=True)

In [11]:
bowl.describe()

,Unnamed: 0,id,order,run_conceded,maidens,wickets,overs,economy,wides,no_balls,...,scorecard_id,match_number,series_id,match_detail_id,runs,over,run_rate,match_id,opp_team_id,team_id
count,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,...,36149.000000,35713.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000,36149.000000
mean,18074.000000,18079.336081,2.479986,34.009212,0.648151,1.090680,6.706423,6.566942,0.666242,0.164403,...,3101.895626,11.402654,238.073225,2654.181222,206.318183,39.219046,6.466686,1431.561869,14.062132,14.072699
std,10435.461777,10441.536156,1.758716,21.814664,1.770139,1.195191,6.753449,3.202527,1.037237,0.644774,...,1778.116416,15.993555,133.515174,1184.481005,93.391823,31.303129,2.250076,848.092414,12.548100,12.520938
min,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,416.000000,2.000000,0.200000,0.990000,1.000000,1.000000,1.000000
25%,9037.000000,9038.000000,1.000000,20.000000,0.000000,0.000000,3.000000,4.250000,0.000000,0.000000,...,1575.000000,1.000000,153.000000,1733.000000,148.000000,20.000000,4.710000,671.000000,3.000000,3.000000
50%,18074.000000,18075.000000,2.000000,30.000000,0.000000,1.000000,4.000000,6.000000,0.000000,0.000000,...,3091.000000,3.000000,235.000000,2489.000000,179.000000,20.000000,6.500000,1442.000000,8.000000,8.000000
75%,27111.000000,27112.000000,4.000000,42.000000,0.000000,2.000000,9.000000,8.330000,1.000000,0.000000,...,4640.000000,17.000000,294.000000,3581.000000,248.000000,50.000000,8.200000,2175.000000,25.000000,25.000000
max,36148.000000,36265.000000,8.000000,246.000000,33.000000,9.000000,77.000000,36.000000,13.000000,13.000000,...,6248.000000,72.000000,507.000000,4840.000000,760.000000,225.200000,18.000000,3017.000000,43.000000,43.000000

In [17]:
bowl.isnull().sum()

Unnamed: 0           0
name_x               0
id                   0
order                0
run_conceded         0
maidens              0
wickets              0
overs                0
economy              0
wides                0
no_balls             0
player_id            0
scorecard_id         0
match_number       436
name_y              12
start_date           0
matchtype           16
series_id            0
match_detail_id      0
title                0
runs                 0
over                 0
run_rate             0
match_id             0
opp_team_id          0
team_id              0
dtype: int64

In [13]:
bowl.shape

(36149, 30)

In [19]:
missing_percentage = (bowl.isnull().mean() * 100).round(2)
print(missing_percentage)

Unnamed: 0         0.00
name_x             0.00
id                 0.00
order              0.00
run_conceded       0.00
maidens            0.00
wickets            0.00
overs              0.00
economy            0.00
wides              0.00
no_balls           0.00
player_id          0.00
scorecard_id       0.00
match_number       1.21
name_y             0.03
start_date         0.00
matchtype          0.04
series_id          0.00
match_detail_id    0.00
title              0.00
runs               0.00
over               0.00
run_rate           0.00
match_id           0.00
opp_team_id        0.00
team_id            0.00
dtype: float64

In [20]:
bowl.dropna(axis=1, inplace=True)

In [21]:
# Checking for duplicates
duplicates = bowl.duplicated()
print(bowl[duplicates])

Empty DataFrame
Columns: [Unnamed: 0, name_x, id, order, run_conceded, maidens, wickets, overs, economy, wides, no_balls, player_id, scorecard_id, start_date, series_id, match_detail_id, title, runs, over, run_rate, match_id, opp_team_id, team_id]
Index: []

[0 rows x 23 columns]

**Batsmen**

In [22]:
bat.shape

(52492, 28)

In [7]:
bat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52492 entries, 0 to 52491
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           52492 non-null  int64
 1   name_x               52492 non-null  object
 2   playing_role         50949 non-null  object
 3   id                   52492 non-null  int64
 4   order                52492 non-null  int64
 5   runs_x               52492 non-null  int64
 6   balls                52492 non-null  int64
 7   strike_rate          52492 non-null  float64
 8   fours                52492 non-null  int64
 9   sixes                52492 non-null  int64
 10  how_out              52483 non-null  object
 11  fall_of_wicket       44 non-null     float64
 12  fall_of_wicket_over  52492 non-null  float64
 13  player_id            52492 non-null  int64
 14  scorecard_id         52492 non-null  int64
 15  match_number         51857 non-null  float64
 16  name_y               52479 non-null  object
 17  start_date           52492 non-null  object
 18  matchtype            52455 non-null  object
 19  series_id            52492 non-null  int64
 20  match_detail_id      52492 non-null  int64
 21  title                52492 non-null  object
 22  runs_y               52492 non-null  int64
 23  over                 52492 non-null  float64
 24  run_rate             52492 non-null  float64
 25  match_id             52492 non-null  int64
 26  opp_team_id          52492 non-null  int64
 27  team_id              52492 non-null  int64
dtypes: float64(6), int64(15), object(7)
memory usage: 11.2+ MB

In [23]:
missing_percentage = (bat.isnull().mean() * 100).round(2)
print(missing_percentage)

Unnamed: 0              0.00
name_x                  0.00
playing_role            2.94
id                      0.00
order                   0.00
runs_x                  0.00
balls                   0.00
strike_rate             0.00
fours                   0.00
sixes                   0.00
how_out                 0.02
fall_of_wicket         99.92
fall_of_wicket_over     0.00
player_id               0.00
scorecard_id            0.00
match_number            1.21
name_y                  0.02
start_date              0.00
matchtype               0.07
series_id               0.00
match_detail_id         0.00
title                   0.00
runs_y                  0.00
over                    0.00
run_rate                0.00
match_id                0.00
opp_team_id             0.00
team_id                 0.00
dtype: float64

In [24]:
columns_to_drop = ['fall_of_wicket', 'fall_of_wicket_over']
bat.drop(columns_to_drop, axis=1, inplace=True)

In [25]:
bat.dropna(axis=1, inplace=True)

In [26]:
bat.shape

(52492, 21)

**Match**

In [27]:
match.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6199 entries, 0 to 6198
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       6199 non-null   int64
 1   match_number     6124 non-null   float64
 2   name             6197 non-null   object
 3   start_date       6199 non-null   object
 4   matchtype        6195 non-null   object
 5   series_id        6199 non-null   int64
 6   match_detail_id  6199 non-null   int64
 7   scorecard_id     6199 non-null   int64
 8   title            6199 non-null   object
 9   runs             6199 non-null   int64
 10  over             6199 non-null   float64
 11  run_rate         6199 non-null   float64
 12  match_id         6199 non-null   int64
 13  opp_team_id      6199 non-null   int64
 14  team_id          6199 non-null   int64
dtypes: float64(3), int64(8), object(4)
memory usage: 726.6+ KB

In [28]:
missing_percentage = (match.isnull().mean() * 100).round(2)
print(missing_percentage)

Unnamed: 0         0.00
match_number       1.21
name               0.03
start_date         0.00
matchtype          0.06
series_id          0.00
match_detail_id    0.00
scorecard_id       0.00
title              0.00
runs               0.00
over               0.00
run_rate           0.00
match_id           0.00
opp_team_id        0.00
team_id            0.00
dtype: float64

In [29]:
match.dropna(axis=1, inplace=True)

**Dimensions of The whole Dataset**

In [30]:
df=[bowl, bat, match]

In [31]:
def dimensions(df):
    for i in df:
        print(i.shape)
        print('*'*100)
        print(i.info())
        print('*'*100)
        print(i.isna().sum())

In [33]:
dimensions(df)

(36149, 23)
****************************************************************************************************

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36149 entries, 0 to 36148
Data columns (total 23 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       36149 non-null  int64
 1   name_x           36149 non-null  object
 2   id               36149 non-null  int64
 3   order            36149 non-null  int64
 4   run_conceded     36149 non-null  int64
 5   maidens          36149 non-null  int64
 6   wickets          36149 non-null  int64
 7   overs            36149 non-null  float64
 8   economy          36149 non-null  float64
 9   wides            36149 non-null  int64
 10  no_balls         36149 non-null  int64
 11  player_id        36149 non-null  int64
 12  scorecard_id     36149 non-null  int64
 13  start_date       36149 non-null  object
 14  series_id        36149 non-null  int64
 15  match_detail_id  36149 non-null  int64
 16  title            36149 non-null  object
 17  runs             36149 non-null  int64
 18  over             36149 non-null  float64
 19  run_rate         36149 non-null  float64
 20  match_id         36149 non-null  int64
 21  opp_team_id      36149 non-null  int64
 22  team_id          36149 non-null  int64
dtypes: float64(4), int64(16), object(3)
memory usage: 6.3+ MB
None
****************************************************************************************************
Unnamed: 0         0
name_x             0
id                 0
order              0
run_conceded       0
maidens            0
wickets            0
overs              0
economy            0
wides              0
no_balls           0
player_id          0
scorecard_id       0
start_date         0
series_id          0
match_detail_id    0
title              0
runs               0
over               0
run_rate           0
match_id           0
opp_team_id        0
team_id            0
dtype: int64
(52492, 21)
****************************************************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52492 entries, 0 to 52491
Data columns (total 21 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       52492 non-null  int64
 1   name_x           52492 non-null  object
 2   id               52492 non-null  int64
 3   order            52492 non-null  int64
 4   runs_x           52492 non-null  int64
 5   balls            52492 non-null  int64
 6   strike_rate      52492 non-null  float64
 7   fours            52492 non-null  int64
 8   sixes            52492 non-null  int64
 9   player_id        52492 non-null  int64
 10  scorecard_id     52492 non-null  int64
 11  start_date       52492 non-null  object
 12  series_id        52492 non-null  int64
 13  match_detail_id  52492 non-null  int64
 14  title            52492 non-null  object
 15  runs_y           52492 non-null  int64
 16  over             52492 non-null  float64
 17  run_rate         52492 non-null  float64
 18  match_id         52492 non-null  int64
 19  opp_team_id      52492 non-null  int64
 20  team_id          52492 non-null  int64
dtypes: float64(3), int64(15), object(3)
memory usage: 8.4+ MB
None
****************************************************************************************************
Unnamed: 0         0
name_x             0
id                 0
order              0
runs_x             0
balls              0
strike_rate        0
fours              0
sixes              0
player_id          0
scorecard_id       0
start_date         0
series_id          0
match_detail_id    0
title              0
runs_y             0
over               0
run_rate           0
match_id           0
opp_team_id        0
team_id            0
dtype: int64
(6199, 12)
****************************************************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6199 entries, 0 to 6198
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       6199 non-null   int64
 1   start_date       6199 non-null   object
 2   series_id        6199 non-null   int64
 3   match_detail_id  6199 non-null   int64
 4   scorecard_id     6199 non-null   int64
 5   title            6199 non-null   object
 6   runs             6199 non-null   int64
 7   over             6199 non-null   float64
 8   run_rate         6199 non-null   float64
 9   match_id         6199 non-null   int64
 10  opp_team_id      6199 non-null   int64
 11  team_id          6199 non-null   int64
dtypes: float64(2), int64(8), object(2)
memory usage: 581.3+ KB
None
****************************************************************************************************
Unnamed: 0         0
start_date         0
series_id          0
match_detail_id    0
scorecard_id       0
title              0
runs               0
over               0
run_rate           0
match_id           0
opp_team_id        0
team_id            0
dtype: int64

In [34]:
def remove_duplicates(df):
    for i in df:
        i.drop_duplicates(inplace=True)
        print(i.shape)
        print('*'*100)

In [35]:
remove_duplicates(df)

(36149, 23)
****************************************************************************************************
(52492, 21)
****************************************************************************************************
(6199, 12)
****************************************************************************************************

### Statistical Summary

In [36]:
def stat_summary(df):
    for i in df:
        print(i.describe(include='all'))
        print('*'*100)

In [37]:
stat_summary(df)

          Unnamed: 0           name_x            id         order  \
count   36149.000000            36149  36149.000000  36149.000000
unique           NaN             1183           NaN           NaN
top              NaN  Ravindra Jadeja           NaN           NaN
freq             NaN              458           NaN           NaN
mean    18074.000000              NaN  18079.336081      2.479986
std     10435.461777              NaN  10441.536156      1.758716
min         0.000000              NaN      1.000000      0.000000
25%      9037.000000              NaN   9038.000000      1.000000
50%     18074.000000              NaN  18075.000000      2.000000
75%     27111.000000              NaN  27112.000000      4.000000
max     36148.000000              NaN  36265.000000      8.000000

        run_conceded       maidens       wickets         overs       economy  \
count   36149.000000  36149.000000  36149.000000  36149.000000  36149.000000
unique           NaN           NaN           NaN           NaN           NaN
top              NaN           NaN           NaN           NaN           NaN
freq             NaN           NaN           NaN           NaN           NaN
mean       34.009212      0.648151      1.090680      6.706423      6.566942
std        21.814664      1.770139      1.195191      6.753449      3.202527
min         0.000000      0.000000      0.000000      0.000000      0.000000
25%        20.000000      0.000000      0.000000      3.000000      4.250000
50%        30.000000      0.000000      1.000000      4.000000      6.000000
75%        42.000000      0.000000      2.000000      9.000000      8.330000
max       246.000000     33.000000      9.000000     77.000000     36.000000

               wides  ...                 start_date     series_id  \
count   36149.000000  ...                      36149  36149.000000
unique           NaN  ...                       2832           NaN
top              NaN  ...  2020-01-03 05:00:00+00:00           NaN
freq             NaN  ...                         44           NaN
mean        0.666242  ...                        NaN    238.073225
std         1.037237  ...                        NaN    133.515174
min         0.000000  ...                        NaN      1.000000
25%         0.000000  ...                        NaN    153.000000
50%         0.000000  ...                        NaN    235.000000
75%         1.000000  ...                        NaN    294.000000
max        13.000000  ...                        NaN    507.000000

        match_detail_id          title          runs          over  \
count      36149.000000          36149  36149.000000  36149.000000
unique              NaN             69           NaN           NaN
top                 NaN  India Innings           NaN           NaN
freq                NaN           3157           NaN           NaN
mean        2654.181222            NaN    206.318183     39.219046
std         1184.481005            NaN     93.391823     31.303129
min          416.000000            NaN      2.000000      0.200000
25%         1733.000000            NaN    148.000000     20.000000
50%         2489.000000            NaN    179.000000     20.000000
75%         3581.000000            NaN    248.000000     50.000000
max         4840.000000            NaN    760.000000    225.200000

            run_rate      match_id   opp_team_id       team_id
count   36149.000000  36149.000000  36149.000000  36149.000000
unique           NaN           NaN           NaN           NaN
top              NaN           NaN           NaN           NaN
freq             NaN           NaN           NaN           NaN
mean        6.466686   1431.561869     14.062132     14.072699
std         2.250076    848.092414     12.548100     12.520938
min         0.990000      1.000000      1.000000      1.000000
25%         4.710000    671.000000      3.000000      3.000000
50%         6.500000   1442.000000      8.000000      8.000000
75%         8.200000   2175.000000     25.000000     25.000000
max        18.000000   3017.000000     43.000000     43.000000

[11 rows x 23 columns]
****************************************************************************************************
          Unnamed: 0    name_x            id         order        runs_x  \
count   52492.000000     52492  52492.000000  52492.000000  52492.000000
unique           NaN      1569           NaN           NaN           NaN
top              NaN  MS Dhoni           NaN           NaN           NaN
freq             NaN       705           NaN           NaN           NaN
mean    26245.500000       NaN  26252.872723      4.102073     22.751353
std     15153.279502       NaN  15162.181529      2.913841     27.865737
min         0.000000       NaN      1.000000      0.000000      0.000000
25%     13122.750000       NaN  13123.750000      2.000000      4.000000
50%     26245.500000       NaN  26246.500000      4.000000     13.000000
75%     39368.250000       NaN  39369.250000      6.000000     32.000000
max     52491.000000       NaN  52688.000000     11.000000    329.000000

               balls   strike_rate         fours         sixes     player_id  \
count   52492.000000  52492.000000  52492.000000  52492.000000  52492.000000
unique           NaN           NaN           NaN           NaN           NaN
top              NaN           NaN           NaN           NaN           NaN
freq             NaN           NaN           NaN           NaN           NaN
mean       27.899013     84.299829      2.228301      0.509849    353.128496
std        38.609592     61.514928      3.153216      1.112621    357.330097
min         0.000000      0.000000      0.000000      0.000000      1.000000
25%         6.000000     41.660000      0.000000      0.000000     87.000000
50%        15.000000     76.920000      1.000000      0.000000    223.000000
75%        34.000000    118.750000      3.000000      1.000000    504.000000
max       559.000000    600.000000     47.000000     17.000000   1692.000000

        ...                 start_date     series_id  match_detail_id  \
count   ...                      52492  52492.000000     52492.000000
unique  ...                       2832           NaN              NaN
top     ...  2020-01-03 05:00:00+00:00           NaN              NaN
freq    ...                         79           NaN              NaN
mean    ...                        NaN    235.322487      2692.767222
std     ...                        NaN    137.088563      1189.888089
min     ...                        NaN      1.000000       416.000000
25%     ...                        NaN    136.000000      1773.000000
50%     ...                        NaN    235.000000      2606.000000
75%     ...                        NaN    300.000000      3595.000000
max     ...                        NaN    507.000000      4840.000000

                title        runs_y          over      run_rate      match_id  \
count           52492  52492.000000  52492.000000  52492.000000  52492.000000
unique             69           NaN           NaN           NaN           NaN
top     India Innings           NaN           NaN           NaN           NaN
freq             4085           NaN           NaN           NaN           NaN
mean              NaN    208.908100     42.599084      6.061302   1425.598834
std               NaN     95.426792     32.884169      2.230929    868.784998
min               NaN      2.000000      0.200000      0.990000      1.000000
25%               NaN    147.000000     20.000000      4.200000    622.000000
50%               NaN    182.000000     31.300000      5.980000   1461.000000
75%               NaN    252.000000     50.000000      7.800000   2201.000000
max               NaN    760.000000    225.200000     18.000000   3017.000000

         opp_team_id       team_id
count   52492.000000  52492.000000
unique           NaN           NaN
top              NaN           NaN
freq             NaN           NaN
mean       12.983216     13.181018
std        12.316898     12.261986
min         1.000000      1.000000
25%         3.000000      3.000000
50%         6.000000      7.000000
75%        24.000000     24.000000
max        43.000000     43.000000

[11 rows x 21 columns]
****************************************************************************************************
         Unnamed: 0                 start_date    series_id  match_detail_id  \
count   6199.000000                       6199  6199.000000      6199.000000
unique          NaN                       2832          NaN              NaN
top             NaN  2020-01-03 05:00:00+00:00          NaN              NaN
freq            NaN                          8          NaN              NaN
mean    3099.000000                        NaN   237.805291      2664.940313
std     1789.641491                        NaN   134.491072      1185.786664
min        0.000000                        NaN     1.000000       416.000000
25%     1549.500000                        NaN   152.000000      1742.000000
50%     3099.000000                        NaN   235.000000      2509.000000
75%     4648.500000                        NaN   294.000000      3590.500000
max     6198.000000                        NaN   507.000000      4840.000000

        scorecard_id          title         runs         over     run_rate  \
count    6199.000000           6199  6199.000000  6199.000000  6199.000000
unique           NaN             69          NaN          NaN          NaN
top              NaN  India Innings          NaN          NaN          NaN
freq             NaN            521          NaN          NaN          NaN
mean     3100.037587            NaN   203.155348    39.129085     6.406145
std      1789.706967            NaN    93.330470    31.306732     2.288660
min         1.000000            NaN     2.000000     0.200000     0.990000
25%      1550.500000            NaN   146.000000    20.000000     4.565000
50%      3100.000000            NaN   178.000000    20.000000     6.440000
75%      4649.500000            NaN   245.000000    50.000000     8.180000
max      6248.000000            NaN   760.000000   225.200000    18.000000

           match_id  opp_team_id      team_id
count   6199.000000  6199.000000  6199.000000
unique          NaN          NaN          NaN
top             NaN          NaN          NaN
freq            NaN          NaN          NaN
mean    1430.847072    13.913696    13.934828
std      853.370211    12.520553    12.499291
min        1.000000     1.000000     1.000000
25%      658.500000     3.000000     3.000000
50%     1446.000000     8.000000     8.000000
75%     2179.500000    24.500000    24.000000
max     3017.000000    43.000000    43.000000
****************************************************************************************************

In [38]:
# let's separate our date into day, month, and year
def separate_date(df):
    for i in range(len(df)):
        if 'start_date' in df[i].columns:
            df[i]['Year']=pd.to_datetime(df[i]['start_date'])
            df[i]['Month']=df[i]['Year'].apply(lambda x:x.month) # Extracting Month
            df[i]['Day']=df[i]['Year'].apply(lambda x:x.day) # Extracting day
            df[i]['year']=df[i]['Year'].apply(lambda x:x.year) # Extracting year
            print(df[i].head())
            print("---------------------------")
        else:
            print("DataFrame", i, "does not have 'start_date' column")
            print("---------------------------")

In [39]:
separate_date(df)

   Unnamed: 0            name_x    id  order  run_conceded  maidens  wickets  \
0        8526      Ajit Agarkar  8544      2            51        0        2
1        8518     Tapash Baisya  8536      0            67        0        2
2        8519  Mushfiqur Rahman  8537      1            29        0        1
3        8520    Nazmul Hossain  8538      2            39        1        2
4        8521     Khaled Mahmud  8539      3            43        0        1

   overs  economy  wides  ...  runs  over  run_rate match_id  opp_team_id  \
0   10.0     5.10      3  ...   234  50.0      4.68      633            2
1   10.0     6.70      3  ...   245  50.0      4.90      633            7
2    6.0     4.83      1  ...   245  50.0      4.90      633            7
3    9.0     4.33      3  ...   245  50.0      4.90      633            7
4   10.0     4.30      2  ...   245  50.0      4.90      633            7

   team_id                      Year  Month  Day  year
0        7 2004-12-22 18:30:00+00:00     12   22  2004
1        2 2004-12-22 18:30:00+00:00     12   22  2004
2        2 2004-12-22 18:30:00+00:00     12   22  2004
3        2 2004-12-22 18:30:00+00:00     12   22  2004
4        2 2004-12-22 18:30:00+00:00     12   22  2004

[5 rows x 27 columns]
---------------------------
   Unnamed: 0            name_x     id  order  runs_x  balls  strike_rate  \
0       13463     Tapash Baisya  13464      9       7      5       140.00
1       13462     Khaled Mahmud  13463      8      21     17       123.52
2       13459       Rajin Saleh  13460      5      14     28        50.00
3       13461  Mushfiqur Rahman  13462      7       2      6        33.33
4       13458       Aftab Ahmed  13459      4      30     49        61.22

   fours  sixes  player_id  ...  runs_y  over  run_rate  match_id opp_team_id  \
0      1      0        850  ...     234  50.0      4.68       633           2
1      3      0        849  ...     234  50.0      4.68       633           2
2      1      0        821  ...     234  50.0      4.68       633           2
3      0      0        848  ...     234  50.0      4.68       633           2
4      2      1        847  ...     234  50.0      4.68       633           2

   team_id                      Year  Month  Day  year
0        7 2004-12-22 18:30:00+00:00     12   22  2004
1        7 2004-12-22 18:30:00+00:00     12   22  2004
2        7 2004-12-22 18:30:00+00:00     12   22  2004
3        7 2004-12-22 18:30:00+00:00     12   22  2004
4        7 2004-12-22 18:30:00+00:00     12   22  2004

[5 rows x 25 columns]
---------------------------
   Unnamed: 0                 start_date  series_id  match_detail_id  \
0        1417  2004-12-22 18:30:00+00:00        182              773
1        1418  2004-12-22 18:30:00+00:00        182              773
2        1419  2004-12-25 18:30:00+00:00        182              774
3        1420  2004-12-25 18:30:00+00:00        182              774
4        1421  2004-12-26 18:30:00+00:00        182              775

   scorecard_id               title  runs  over  run_rate  match_id  \
0          1495       India Innings   245  50.0      4.90       633
1          1496  Bangladesh Innings   234  50.0      4.68       633
2          1497  Bangladesh Innings   229  50.0      4.58       634
3          1498       India Innings   214  47.5      4.47       634
4          1499       India Innings   348  50.0      6.96       635

   opp_team_id  team_id                      Year  Month  Day  year
0            7        2 2004-12-22 18:30:00+00:00     12   22  2004
1            2        7 2004-12-22 18:30:00+00:00     12   22  2004
2            2        7 2004-12-25 18:30:00+00:00     12   25  2004
3            7        2 2004-12-25 18:30:00+00:00     12   25  2004
4            7        2 2004-12-26 18:30:00+00:00     12   26  2004
---------------------------

In [40]:
# Let's drop the remaining irrelevant columns
def drop_irrelevant(df):
    for i in range(len(df)):
        columns_to_drop = ['Unnamed: 0', 'start_date', 'Year']
        irrelevant_columns = [col for col in columns_to_drop if col in df[i].columns]
        
        if irrelevant_columns:
            df[i].drop(columns=irrelevant_columns, axis=1, inplace=True)
            print("DataFrame", i, "after dropping irrelevant columns:")
            print("Dataframe", i, "does not have any irrelevant columns")
            print("-------------------------")

In [41]:
drop_irrelevant(df)

DataFrame 0 after dropping irrelevant columns:
Dataframe 0 does not have any irrelevant columns
-------------------------
DataFrame 1 after dropping irrelevant columns:
Dataframe 1 does not have any irrelevant columns
-------------------------
DataFrame 2 after dropping irrelevant columns:
Dataframe 2 does not have any irrelevant columns
-------------------------

In [ ]:
df_list